Revit 2024 API
ParameterTypeId.FillPatternIdParam Property
 "Cut fill pattern"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FillPatternIdParam { get; }
Visual Basic
Public Shared ReadOnly Property FillPatternIdParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FillPatternIdParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace